Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 江逸的目的其实很明确，既然逃无可逃，那只有战了！而今日要想安然脱身，那唯有……拿下江如虎。
en_us: Jiang Yi's aim was actually very clear-cut - since he had no way of escape, he had no choice but to fight his way out! On top of that, if he wanted to get away safely, there was no choice but to... take down Jiang Ruhu.

source: 江逸的眼睛一直死死盯着着对方的反应，此刻见对方果然来抓他偷袭的左手顿时大喜，早就准备好的右腿膝盖，猛然对着这护卫的下身顶去。
en_us: Jiang Yi's eyes had been consistently fixed on his opponent to catch his every reaction. Jiang Yi was immediately elated upon seeing that his opponent was indeed trying to catch the left hand Jiang Yi used in his sneak attack at that moment. With a right knee that he had prepared in advance, he suddenly kicked upwards, in the direction of the lower half of the guard's body.

source: 江逸的确不想再多管闲事，只是他不清点药田内的草参，就没法回去复命。那点微薄的月例将会全被扣掉，小奴也将会更加辛苦的在外面做工……
en_us: Indeed, Jiang Yi did not want to meddle in Jiang Bao’s business. It was just that… if he could not account for the grass ginseng grown in the medicinal plantations, he could not report back to Supervisor Rong. He would end up having his already morsel-sized monthly salary docked fully… and Xiaonu would have to work even harder outside…

source: 江逸的缠丝手还没抓住姬听雨的手掌，却被对方一记掌刀砍中，一阵生疼传来他的双手立即被震退，身子也因一股巨力震得连退三步。而姬听雨的身影早已经站立在原地，含笑盈盈望着他。
en_us: Before Jiang Yi's Silk Hand technique could grab hold of Ji Tingyu's palms, his opponent's palms had cut down his hands in a chopping movement. A fresh agonising pain reveberating from his hands forced him to pull back immediately in shock, while a great shockwave caused him to continuously retreat backwards by three steps. As for Ji Tingyu, her figure remained rooted and standing at attention on her original spot, while she herself observed him with a bright smile on her face.

source: 江逸的背微微弓着，如一只野兽般盯着江如虎，余光四处扫视，两耳时刻倾听四周的所有响动声，脑海内疯狂转动，寻找破局之法。
en_us: Jiang Yi bent his back slightly and stared at Jiang Ruhu like a wild beast. He gazed his surroundings through his perpheral vision, while both of his ears were constantly and attentively listening to all movements and sounds. His mind was spinning like crazy, as he tried to find a way to break out of his current circumstances.

source: 江逸的蛇鞭腿紧随其后而来，不断踢在刘管事的大腿上，再次把他震退几步，而江逸的身子则借助这几腿之力一跃而上，身子在半空中扭转，单拳对着旁边满眸惊愕的马公子狠狠砸去。
en_us: Jiang Yi's Snake Whip Leg followed closely behind, raining hits on Housekeeper Liu's thighs and forcing him back several steps farther. In the same instant, leveraging on the strength of the multiple kicks he delivered, Jiang Yi leaped up into the air. He turned in mid-air to face the stunned Young Master Ma and raised a fist to punch him hard.

source: 江逸的计谋不错，但他算错了一点，江如虎见江逸冲上来，竟然没有大怒迎上去，反而身子快速爆退，同时大喝起来催促众人朝江逸围攻而去。
en_us: Jiang Yi's strategy was not bad, but he miscalculated one thing - Jiang Ruhu had seen Jiang Yi rush towards him and, instead of being enraged and meeting him head-on, he instead retreated backwards in explosive haste. At the same time, he started shouting loudly to urge his gangmembers to attack in the direction of Jiang Yi from all sides.

source: 江逸的话刚刚说完，武堂长老的大手就呼啸而去，重重拍在他左肩。江逸的左肩膀瞬间衣袍爆裂，鲜血横飞，整个人重重撞在墙壁上，反弹回来在地面翻滚几圈才挣扎站了起来！
en_us: Just as Jiang Yi finished his statement, the Martial Court Elder's hand hurtled over and landed a heavy pat on his left shoulder. Jiang Yi's left shoulder's robe instantly burst apart with fresh blood splattering across as he crashed into the wall. He bounced off the wall and tumbled for a few rounds before struggling to get up!

source: 江逸的话说的很隐晦，但冰雪聪明的姬听雨，又怎么会听不出潜在意思。他不喜欢和她们这群公子小姐有交集，而一旦姬听雨不断找他，麻烦就会随之而来……
en_us: Jiang Yi's words were obscure, but to someone as smart as Ji Tingyu, the veiled meaning was crystal clear: he did not like associating with the young masters and mistresses of her kind, and as long as Ji Tingyu interacted with him, trouble would follow...

source: 江逸的身份是旁系少爷，按照江家规矩，他每月本可以领取三枚辅助修炼的人阶中品的“元魂丹”，还有两枚人阶中品的疗伤丹药“黑参丹”，方便修炼时不小心受伤及时疗伤。
en_us: As a young master from a branch family, according to Jiang Clan laws, Jiang Yi could redeem three Man-tier medial-grade "Essence Soul Pills", which could help in his refining training; as well as two Man-tier medial-grade "Black Ginseng Elixirs", healing elixirs that could be easily and quickly taken should he injure himself during refining and training.

source: 江逸的身子如风般朝那屋子内冲去，房门关上的，他一脚重重的踹了上去。此刻他脚上元力灌注，这一脚力道十足，房门瞬间四分五裂，轰然倒下。
en_us: Jiang Yi swiftly rushed towards the building. He gave the closed door a heavy kick that was infused with essence force. The strength of the kick was sufficient to destroy the door into pieces as it fell.

source: 江逸的速度的确增快了两三倍，情急之下他动用了一丝黑色元力在左腿，速度一下如风驰电击，只是十几个呼吸时间他就从家族西门冲出了外面大街上，幸好路上没遇到江家的族人，否则肯定让人起疑的……
en_us: Jiang Yi's speed had indeed increased two to three times. In his anxiety, he had used a sliver of black essence force on his left leg, raising his speed to that of a lightning bolt. In about half a minute, he dashed out of the clan's western gate and onto the streets outside. Luckily, he was not seen by anyone from the Jiang Clan clan, otherwise he would definitely raised some eyebrows…

source: 江逸盘坐在后院，暗暗咬牙，这几天时间他的封印上的符文又破解了数十枚，修炼速度还在逐步的增加，已经达到了原先的是七八倍。
en_us: Sitting cross-legged in the backyard, Jiang Yi silently clenched his teeth. Over the past few days, he had removed many runic characters on his seal. His refining speed was also progressively increasing. It had now reached seven or eight times his original speed.

source: 江逸盘坐地上琢磨起来，想了很久却完全不知道怎么办。突然，他眼睛一亮，一拍脑袋站了起来朝偏厅内走去。
en_us: Jiang Yi sat cross-legged on the ground and started to reflect on what happened. He pondered for a long time, but he completely had no idea what to do. Suddenly, his eyes lit up. Slapping himself on the forehead, he stood up and walked towards the interior of the side room.

source: 江逸目光一开始就被江恨水吸引了，所以并没有注意跟在他身后的人，此刻听到声音却不用看都知道，后面跟着的人是谁了。
en_us: Jiang Yi's attention had just been absorbed by Jiang Henshui, so he did not pay attention to the person behind him. He did not need to see to know the person speaking and following behind Jiang Henshui.

source: 江逸目光死死锁定那两只真实的拳影，脑海内快速预算对方的攻击轨迹和速度，提前判断，先一步躲避退走，让对方再次砸空。
en_us: Jiang Yi's eyes were firmly locked on to the figures of her two actual fists, as he calculated at quick speed in his brain the opposing party's attack trajectory and speed. As he had already predicted the incoming attacks in advance, he had already taken the action to avoid the attack and retreat backward, allowing the opposing party to hit nothing but air once again.

source: 江逸直接打断他的话，沉着脸警告道：“小奴，你记住，从今天开始你再也不许离开江家大院，否则你就不要认我这个少爷了。”
en_us: Jiang Yi cut her off immediately and warned her, "Xiaonu, you must remember, from today onwards you will never be allowed to leave the Jiang Residence Central Courtyard. Otherwise, you can forget about ever recognizing me as your Young Master anymore."

source: 江逸眉头一皱，有些慌乱起来，江云海的曾经在王府内做过事，还当众说江逸是他的少主，如果了解内情的人一猜就能明白。
en_us: Jiang Yi frowned and started to panic. Jiang Yunhai used to work at the Lord's household, and even said in front of everyone that Jiang Yi was his young master. Anyone who knew what was going on can easily guess the truth behind the matter.

source: 江逸看到江松如此，有些愧疚的宽慰道：“江松，对不起，我也不是有意的……”
en_us: Seeing Jiang Song's condition, with some regret Jiang Yi tried to console him by saying, "Jiang Song, I'm sorry. I did not mean to do it..."

source: 江逸看到马飞的脸色就知道要坏事了，暗道晦气，今日出门这么没看黄历？恰好遇到了马家的纨绔少爷？这马家和江家是世仇，马家的任何一名纨绔少爷遇到今天这事，肯定都会出手。
en_us: One look at Ma Fei's demeanor told Jiang Yi that things would not go well. He silently cursed his bad luck. Why had he not consulted the almanac today before leaving the house? And to have so coincidentally come across such a wastrel playboy of the Ma Family? With the feud between the Ma and Jiang families, any wastrel descendant in the Ma Family would have chosen to take action against him.

source: 江逸看得砰然心动，这柳长老可是说了爱拿多少拿多少，那不是表明他可以多拿几枚丹药，还可以拿人阶中品、上品的丹药？
en_us: Jiang Yi felt a rush of excitement the more he looked. Elder Liu did say he could take as much as he wanted, so does that not mean that he could take more elixirs, and even take those elixirs of Man-tier medial or even superior grade?

source: 江逸眨了眨眼睛，暗道侥幸，不过看到对方的拳头近在咫尺，他也顾不上多想，下意识的继续运转元力，身形一扭朝旁边躲避，同时双手也继续朝江豹打出的重拳架去。
en_us: Jiang Yi blinked his eyes in disbelief, feeling relieved on the inside. However, seeing the opponent’s fists within mere inches from his face, without thinking too much, he subconsciously continued to circulate his essence force. He moved his body to the side to avoid the attack while shooting both his fists at Jiang Bao.

source: 江逸眸子一下冷了下来，不是因为对方又要他入赘，而是因为这翊龙宇提到了江家。
en_us: Jiang Yi's expression turned icy, not at yet another request for him to marry into the Yi Family, but at Yi Longyu's mention of the Jiang Clan.

source: 江逸眸子一冷，下意识的朝江麒麟望去，果然看到他正注视着自己，眸子内都是杀意。看到小胖子亲热的走过来，江逸顿时气不打一处来，抬手对着他的后脑勺就是一下，低骂道：“钱万贯，你故意的是不是？”
en_us: Jiang Yi gave a chilly look, and took an instinctive glance towards Jiang Qilin. Sure enough, Jiang Qilin was glaring at him, with the intend to kill. Seeing the Fatty walk towards him plausibly made Jiang Yi could not help but feel angry. He raised his hand and smacked the back of Fatty's head, and bellowed in a deep voice," Qian Wanguan, you did it on purpose, didn't you?"

source: 江逸眸子内冷意一闪，不过他却没有像昨日那般冒然过去查看，不想再惹事端的话，只能佯装没看到，继续清点草参。
en_us: A chill went down Jiang Yi’s spine. Unlike the day before, however, he did not rashly rush over to check, but rather decided to ignore the noise and instead pretend to not have heard it. He continued counting the medicinal plants around him, lest he faced new problems.

source: 江逸眸子闪烁，脑海一转，突然有个很胆大的想法：“难道是因为我注入了两缕黑色元力，这才炸丹的？剩下两枚不仅没炸，反而由白色变成了黑色？也是因为这两缕黑色元力的缘故？”
en_us: Jiang Yi's eyes flickered as his mind raced, suddenly coming up with a bold idea. What if the exploding elixirs were caused by me inserting two strands of black essence force? Not only did the remaining two pills not explode, their colors changed from white to black? Were these two strands of black essence force also the reason behind it?

source: 江逸眼中恨意一闪，这人他认识，是昨日和江如虎一起偷药，一同殴打他的家族旁系子弟之一，也是江如虎的著名狗腿子。估计这厮以为自己才被打伤，今日应该不会上山，又贪心地跑来多偷点药吧？
en_us: Jiang Yi felt a surge of hatred. He knew this boy. He had stolen medicine with Jiang Ruhu yesterday and was one of the many branch members who ganged up to beat up Jiang Yi. In other words, he was one of Jiang Ruhu’s many infamous lackeys. It seemed likely that this idiot had presumed that Jiang Yi was badly injured in the fight and that he was unlikely to go to the Western Hills. Due to this, he had returned to the plantation fields to steal more medicinal plants.

source: 江逸眼中露出一丝狠色，和春芽交代一声，拔腿就往外狂奔而去。时间紧迫，他也没时间去多想了，只能孤身前往，就算被活活打死他也必须救出江小奴。
en_us: After that, he took to his heels and dashed out. He did not have the luxury of time to think through the matter. All he could do was head out alone. Even if he was beaten to death, he had to save Jiang Xiaonu.

source: 江逸眼中黑光一闪，第一次动用黑色元力，他冷喝一声身子如一道残影般朝前方冲去，双拳幻化成六道残影，将最前方的江顾水笼罩进去。
en_us: Jiang Yi's eyes had a flash of black light. This was his first time utilizing the black essence forces. With a shout, his body was like a phantom dashing forward. His fists produced six phantom afterimages and shrouded Jiang Gushui who was leading the charge.

source: 江逸眼中黑光流转，江如虎的动作一切清晰可见，轻松判断出他攻击的轨迹，融合了一丝黑色元力的拳头长驱直入重重的砸在江如虎的左肩上。
en_us: A black flash circulated within Jiang Yi's eyes, allowing him to clearly and distinctly see Jiang Ruhu's every action. As such, he could easily determine Jiang Ruhu's attack trajectory. His fist, which had merged with a wisp of black essence force, drove straight and smashed heavily into Jiang Ruhu's left shoulder.

source: 江逸眼眸一亮，感激的抱拳一揖，内心也被激起豪气冲天，笑道：“他日若是凌云志，一定不忘小姐的教诲。”
en_us: Jiang Yi's eyes lit up. He cupped his fists raised them in gratitude. A heroic spirit was also aroused and soared highly in his heart. Smiling, he replied, "In the future, should I achieve greatness, I would definitely not forget Young Mistress's teachings and advice."

source: 江逸眼眸一冷，这风月楼他知道，是江家所在东城最大的青楼。他也跟踪过小奴一次，也知道她出去做工就是在风月楼后院帮他们洗衣物床单，换取微薄的银钱。
en_us: Jiang Yi gave a chilly look. He knew about Fengyue Brothel. It was the Jiang Clan's biggest brothel in the East City. He had once followed Xiaonu there and knew that she had been working at the brothel's back kitchen washing their laundry and bedding for a few meager taels of silver.

source: 江逸眼眸一冷，铁拳瞬间收回，却立即变招化作缠丝手抓住江如虎的头发，朝后猛然一拽单腿重重一扫，江如虎肥胖的身躯轰然倒地。
en_us: Jiang Yi let out a stare and instantly withdrew his iron fist, then change into Silk Hands to grasp Jiang Ruhu's hair. He then did a vigorous leg sweep to bring Jiang Ruhu's plump body to the ground.

source: 江逸眼眸一缩，下意识的开口问道：“只是做陪练？不需要其他的？”
en_us: Jiang Yi squinted his eyes and made himself decide to open his mouth to ask, "Do I do exclusively the work of a sparring partner? Do I not need to do anything else for you?"

source: 江逸眼眸一缩，他在江家月例只有一两碎银子，这一两紫金可是一百两银子啊，就算把他卖了也不值十两紫金，这伙人看来是打定主意要留下江小奴了。
en_us: Jiang Yi's pupils contracted. His monthly salary was only worth one tael of tiny silver pieces, but one tael of purple silver was equivalent to one hundred taels of silver! One could not possibly earn ten taels of purple gold even if Jiang Yi was sold off. It was clear that this guy had set his mind on ensuring Jiang Xiaonu stayed behind.

source: 江逸眼眸死死盯着对方的双手，却发现根本无法预算对方的攻击轨迹，因为对方最少可以随意变招三四次。
en_us: Jiang Yi locked his gaze on his opponent's hands, but to his dismay, he was unable to predict where the attacks would come from, seeing how Yi Longyu could easily change his technique at least three to four times in an instant.

source: 江逸眼睛看着管事，余光却偷偷观察那马家少爷的反应，漠然说道：“钱我带来了，令牌给我吧。”
en_us: Jiang Yi looked at the housekeeper, while out of the peripheral he was furtively gauging the reactions of the Ma Family young master. "I have the money, so why don't you give me the command token," he said nonchalantly.

source: 江逸眼花缭乱地读着那些小篆字符，心里非常惊讶，这些黑色的小篆体文字在整体旋转之余，竟然还以自身为中心上下翻转游动着，就如小蝌蚪一般，充满生命的气息。
en_us: Jiang Yi tried to read the tiny, dazzling words, yet could not help but feel shocked and awed by the scene before him. Besides spinning around his body, the tiny script was able to move around freely like little tadpoles filled with the energy of life.

source: 江逸瞬间调集出一丝黑色元力，朝左眼角运转而去，对付江松这种铸鼎界二重的纨绔子弟，他都不屑调集黑色元力增幅攻击力量。当然他也不想让太多人知道，他力量能暴增的事情，比武技？这江松还差远了！
en_us: Jiang Yi hastily assembled a strand of black essence force, releasing the power in the direction of where his left eye was looking. To defeat a wastrel descendant at a second level of the Cast Tripod Realm like Jiang Song, he thought it was not worth it to assemble more black essence force and increase his own attack power. Of course, he did not want to let too many people know of his condition that he could greatly increase his power. Comparing martial arts prowess? Jiang Song's level was far worse than his own!

source: 江逸破门而入，自然惊动了房间内的壮汉，那壮汉本能的一惊，不过看到江逸破空而来的拳头却冷笑起来：“铸鼎境一重也敢来这放肆？找死！”
en_us: The man was naturally startled when Jiang Yi slammed through the door. Overcoming his initial shock, he sneered when he saw Jiang Yi's punch tearing through the air. "How dare a first-stage Cast Tripod Realm brat be so presumptuous? Are you sick of living!?"

source: 江逸确定对方不再变招后，双手瞬间化掌为爪，轻松提前抓住对方的手腕，脚步朝旁边一滑，双手牵引对方朝另外一边攻去，身体一下转到了翊龙宇身后。
en_us: Jiang Yi ascertained that his opponent would not change his technique, before springing into action. Hands posing into claws, he deftly grabbed Yi Longyu's wrists and sidestepped, hands pulling the man in the other direction, dissolving the attack while moving behind Yi Longyu in the same breath.

source: 江逸神情冰冷，脸色没有一丝变化，听到江如虎的话语，他双手将江如虎狠狠抡了一个圈，然后重重的砸在地面……
en_us: Jiang Yi's facial expressions remained ice-cold without a shred of change, as he heard Jiang Ruhu's cries of warning. Both his hands ruthlessly swung Jiang Ruhu around in a circle, before heavily smashing him onto the ground...

source: 江逸神色冷峻，双手依旧缠住江松，还微微用力让他完全不能控制身体重心，双腿如电般朝江松的右腿连续抽去，而且还单独对着小腿处穷追猛打……
en_us: Jiang Yi's expression turned grave, but his hands still continued to entangle Jiang Song. He had even applied some slight force to make him completely unable to control the center of gravity of his body. His legs continued to hit Jiang Song's right leg non-stop like bolts of electricity. He aimed specifically at his lower leg...

source: 江逸突然再次变招，如此近的距离马飞自然躲避不了，轻松被他抓住手腕。江逸手一用力一扭，马飞的腕骨立即一痛，痛哼一声，再也控制不住那把青色短剑。
en_us: Jiang Yi abruptly changed his technique again. At such close proximity, it was impossible for Ma Fei to dodge the attack and his wrist was easily captured. Jiang Yi applied force and twisted hard, causing immediate pain to shoot up Ma Fei's wrist. Grunting in pain, Ma Fei lost control of the teal-colored short sword.

source: 江逸突然想到一件事情，心神一荡，黑色元力增幅药力和可以直接快速疗伤，那可是两回事。如果是后者，那就变态了！他以后受伤了完全都不必借助于疗伤丹药了……
en_us: Jiang Yi suddenly thought of something and his heart skipped a beat. It was two separate matters altogether between the black essence force increasing the strength of the medical effects and being able to directly speed up the healing process. If it were the latter, how obscene powerful would that be! In the future, he would no longer have to heal his wounds with the help of healing elixirs...

source: 江逸突然想到一件事，从怀中取出一块令牌递给江小奴道：“小奴，你看这是什么？”
en_us: It dawned on Jiang Yi to retrieve the command token from his chest pocket and showed it to her, "Xiaonu, look what I've got?"

source: 江逸突然想到了什么，猛地透过院子朝远处看去，外面的景物同样清晰得吓人，就连数十丈外空中飞过一只蚊子都能看清楚轨迹。
en_us: Jiang Yi thought of something suddenly. He looked abruptly into the distance across the yard. Similarly, the scene outside was just shockingly vivid. He could very clearly see the trajectory of a mosquito flying in the distance hundreds of feet away.

source: 江逸突然想起一件事，暗道不妙，他的黑色元力好像也是元力？也在丹田内？既然元力被封印了，这黑色元力自然也会被封印啊？没有黑色元力，他的下场就只能和刚才那两人一样，被活活打得半死踹飞出去……
en_us: Jiang Yi suddenly thought of something and muttered to himself that something was amiss. Was his black essence force not a type of black essence force too? Was it not within his dantian? Since essence force was sealed off from use, would his black essence force naturally be sealed off as well? Without any black essence force, he had no other result beyond ending up in a condition similar to those two persons before him: being simply beaten half to death, and sent flying out with a kick...

source: 江逸突然指着门外对着钱万贯吼了起来，小胖子抖了抖鼻子讪讪的走出去了。江逸直接扑到在床上，痛苦的闭上眼睛，脑海内如浆糊般一团糟。他胡思乱想了一阵，很快坐了起来揉了揉脸，强迫自己冷静下来，分析情况。
en_us: Jiang Yi suddenly hollered at Qian Wanguan and pointed towards the door. Fatty scrunched his nose and walked out feeling embarrassed. Jiang Yi plunged towards the bed and shut his eyes in pain. His mind was in a complete mess. His thoughts run wild for a while, but he quickly sat up and rubbed his eyes, forcing himself to calm down and analyse the situation.

source: 江逸立即调集一丝黑色元力，再次运转到伤口附近和药力融合起来，快速治疗伤势。
en_us: Jiang Yi immediately summoned a strand of black essence force, before once again sending it near the wound area, to amalgamate with the medicinal power and speed up the wound-healing process.

source: 江逸站了一会，那柳长老还是无视他，只好咬牙拱手道：“我想领一枚黄参丹和元力丹……”
en_us: Jiang Yi stood for a while, but Elder Liu continued to ignore him. He had no choice but to grit his teeth, cup his hands and say, "I would like to acquire a pill each of Yellow Ginseng Elixir and Essence Force Elixir..."

source: 江逸站了起来拍了拍衣袍，淡淡一笑道：“小姐很厉害了，如此年纪已经是铸鼎境四重，如果不是元力封印，我一招都会被你打趴下。”
en_us: Jiang Yi stood up and patted his robes, before giving a faint smile. He said, "Young Mistress, you are so powerful, your power level is already at the fourth stage of the Cast Tripod Realm even though you're so young. If not for your essence forces being sealed off from use, I would probably have been beaten down by you and lost the match before I can even use a single technique."

source: 江逸站在药田田梗上，望着药田内密密麻麻的绿色草参叶子，脸上一阵苦涩，他昨日就是在这被殴打昏迷，好不容易才挨回家的……
en_us: Jiang Yi stood at the boundary of the fields, staring into the verdant green of the grass ginseng. A sense of bitter agony filled his mind—after all, this was the place where he was beaten up and left unconscious. After regaining consciousness he had to endure with much difficulty and agony the journey home.

source: 江逸站起来迎了上去，那江松却做了个嘘声的动作，凑过来有些疑惑低声问道：“江逸，你怎么在炼药房？长老有没有在里面？”
en_us: Jiang Yi stood up to greet him, but Jiang Song made a hand gesture asking him to keep quiet, before moving closer to him. "Jiang Yi," he asked in a low voice, "what are you doing in the alchemy lab? Is the elder inside?"

source: 江逸第一次来这种大地方，有些不知道如何是好。好在他站了一会，一名穿着管事袍子的中年人就走过来询问道：“请问这位客人有什么需要吗？”
en_us: This was the first time Jiang Yi had visited such a large place; as such, he did not know what to do. After standing at the same spot for a long while, a middle-aged man wearing a managerial robe walked over to him and inquired, "My dear guest, how may I be of assistance?"

source: 江逸精神一震，连忙说道：“十两紫金。”
en_us: Jiang Yi's spirit jolted with excitement as he promptly replied, "Ten taels of purple gold."

source: 江逸纳闷了，闭上眼睛内视丹田，观察剩下的唯一一缕黑色元力，但观察了很久还是一无所获。
en_us: Jiang Yi was puzzled. Closing his eyes and using his inner vision to look into his dantian, he observed the one and only wisp of black essence force left in his body. However, he acquired no new knowledge, despite observing it for a very long time.

source: 江逸细细感知了半天，摇了摇，又掐了掐脑袋，在确认黑色小字应该不具备危险性后，终于长吁了一口气，多年来的压抑生活，让他的心理承受能力远超同龄人。
en_us: Jiang Yi lay on the bed deep in thought for a while. After a moment, he shook his body, then pinched his head. When he confirmed that those tiny black words were probably not harmful to his well-being, he finally heaved a long sigh of relief. Many years of oppression in a depressive life had conditioned his spirit. His ability to endure more stress was greater than that of most other people of his age.

source: 江逸绷紧的心立即放松了一大半，等一名护卫从房间内取出一枚令牌后，他的心完全放了下来，从怀中取出十片紫金叶子朝管事递过去。
en_us: At once, Jiang Yi's highly-strung nerves relaxed almost completely. By the time the guard came in with the retrieved command token, he was entirely at ease and reached into his chest pocket to hand over ten pieces of purple gold leaf to the housekeeper.

source: 江逸缩了缩头，暗道这柳长老果然是个怪人，刚才还满脸狂喜，这说翻脸就翻脸了……
en_us: Jiang Yi retracted his head, thinking to himself silently that this Elder Liu was no doubt a weird man—just moments before he was all smiles, yet instantly he could become hostile...

source: 江逸老老实实的拱手道：“回荣管事，还没……”
en_us: Jiang Yi sincerely cupped his hands and said, "Chief Rong, not yet—"

source: 江逸耸了耸肩，走出去继续回去修炼，然而……只是半个时辰后他又被杨管事叫了出来，这次还是有人点名要他陪练。
en_us: Jiang Yi shrugged and went back to his cultivation. However... he was summoned again by Manager Yang an hour later, as another guest had requested his service.

source: 江逸脚刚刚落地，身子又猛然在地面一踏跃空而起，单腿重重的抬起对着江松一条腿重重劈下。
en_us: Just as Jiang Yi landed, his body vigorously jumped into the air again. He raised one of his leg and swung it down at Jiang Song.

source: 江逸脸上一片冷意，身子如猎豹般朝马公子和刘管事冲去，根本不惧漫天的粉末。他哪有什么毒粉？刚才那黑呼呼的东西是江小奴给他准备的干肉……
en_us: There was nothing but a look of ruthlessness on Jiang Yi's face. He charged at Young Master Ma and Housekeeper Liu as fast as a cheetah, completely undeterred by the powder filling the air - for how could he possess such a thing as poison powder? The black substance was actually just the jerky that Xiaonu prepared for him...

source: 江逸脸上没有半点慌乱，面对家族的武堂的长老，江家战力排行第三的强者依旧不亢不卑，他沉声拱手说道：“这些人全部是我伤的，去刑堂可以，我也可以认罪。不过我请求家族所有长老在旁边听审，否则……我死也不去刑堂，还请长老亲手杀了江逸吧！”
en_us: Jiang Yi's face didn't have an hint of frenetic, even with facing the clan's Martial Court Elder. He spoke with a neither overbearing nor servile to the clan's overall no.3 combatant, "All these people are injured by me. I will go to the Disciplinary Court and I will admit my mistakes too. But I beg for all the clan's Elders to be at the hearing. If not... I would rather die than go to the Disciplinary Court. I beg for Elder to personally execute Jiang Yi!"
